БИТУправление_медицинским_центром_демо/src/Documents/РаботыПоРекламации/РаботыПоРекламации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаботыПоРекламации</name>
  <registerRecords>InformationRegister.СписанныеТовары</registerRecords>
  <registerRecords>AccumulationRegister.РасходМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладМатериалов</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекламация</name>
    <type>
      <types>DocumentRef.Рекламация</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Заявка</types>
      <types>DocumentRef.Прием</types>
      <types>CatalogRef.Клиенты</types>
      <types>DocumentRef.Рекламация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычитатьИзВыработкиВиновника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаМатериалов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтрокиРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ВыработкаСотрудников/ВыработкаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыработкаСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <comment>Продолжительность в секундах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВыработки</name>
    <type>
      <types>EnumRef.ТипыВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТрудоваяРоль</name>
    <type>
      <types>CatalogRef.ТрудовыеРоли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/РасходМатериалов/РасходМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасходМатериалов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>РасходФактический</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасходНормативный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаМатериала</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОплачиваетсяКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СписанныеТовары/СписанныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СписанныеТовары</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДокументПартии</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерСтрокиДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыВыработки/ТипыВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВыработки</name>
  <comment>Услуги-Материалы-Товары</comment>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
  <enumValues>
    <name>УслугиПоАбонементу</name>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>Абонементы</name>
  </enumValues>
  <enumValues>
    <name>Сертификаты</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/РаботыПоРекламации/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Работы") Тогда
			Для Каждого СтрокаРабот Из ДанныеЗаполнения.Работы Цикл
				НоваяСтрока = ЭтотОбъект.Работы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРабот);
				НоваяСтрока.КлючСтроки = НоваяСтрока.НомерСтроки;
			КонецЦикла;
			Документы.РаботыПоРекламации.ЗаполнитьМатериалыПоНормамРабот(ЭтотОбъект);
		ИначеЕсли ДанныеЗаполнения.Свойство("Рекламация") Тогда
			ЭтотОбъект.Рекламация = ДанныеЗаполнения.Рекламация;
			Документы.РаботыПоРекламации.ПерезаполнитьРаботыПоРекламации(ЭтотОбъект, УчетнаяПолитика.ВестиУчетРасходаМатериаловНаУслуги);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		ДокументыРабот = CRMСервер.ПолучитьДокументыРаботПоРекламации(ЭтотОбъект.Рекламация);
		Если ДокументыРабот.Количество() > 0 Тогда 
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Работы по данной рекламации уже отражены документом " + Строка(ДокументыРабот[0]));
		КонецЕсли;
	КонецЕсли;
	ЭтотОбъект.ВычитатьИзВыработкиВиновника = ЭтотОбъект.ВычитатьИзВыработкиВиновника И
		ЗначениеЗаполнено(ЭтотОбъект.Рекламация.Исполнитель) И
		ЭтотОбъект.Рекламация.Исполнитель <> ЭтотОбъект.Исполнитель;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента, ТаблицаПоРаботам, ТаблицаПоМатериалам;
	
	Движения.ВыработкаСотрудников.Записывать = Истина;
	
	Заголовок = НСтр("ru='Проведение документа'");
	Заголовок = Заголовок + " """ + СокрЛП(Ссылка) + """: ";
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	СтруктураОбязательныхПолей = Новый Структура("Клиент");	
	Если ЕстьСтрокиСПустымСкладом("Материалы") Тогда
		СтруктураОбязательныхПолей.Вставить("СкладМатериалов");
	КонецЕсли;	
	СтруктураОбязательныхПолей.Вставить("Исполнитель");
	
	// Вызываем общую процедуру проверки.
	ПроведениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	НачислятьВыработку = ЗначениеЗаполнено(Исполнитель) И (ЭтотОбъект.Рекламация.Исполнитель <> Исполнитель);
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоМатериалам, ТаблицаПоРаботам);
	
	Если Не Отказ Тогда
		
		ВыполнитьДвиженияПоВыработкеСотрудников(НачислятьВыработку);
		РегистрыНакопления.РасходМатериалов.ВыполнитьДвиженияПоРегистру(ЭтотОбъект,ТаблицаПоМатериалам, ТаблицаПоРаботам, СтруктураШапкиДокумента, Отказ);
		
		ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоМатериалам, Отказ, Заголовок);
		ПартионныйУчет.пуДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить(), Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаПоМатериалам, ТаблицаПоРаботам)
	
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Работы".
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Номенклатура"		  , "Номенклатура");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры" , "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("ВидНоменклатуры"     , "Номенклатура.ВидНоменклатуры");
	СтруктураПолей.Вставить("Количество"          , "Количество");
	СтруктураПолей.Вставить("Цена"                , "Цена");
	СтруктураПолей.Вставить("Сумма"               , "Сумма");
	СтруктураПолей.Вставить("СуммаБезСкидок"      , "СуммаБезСкидок");
	СтруктураПолей.Вставить("КатегорияВыработки"  , "Номенклатура.КатегорияВыработки");
	СтруктураПолей.Вставить("КлючСтроки"        	, "КлючСтроки");  
	СтруктураПолей.Вставить("Сотрудник"				, "Ссылка.Исполнитель");
		
	РезультатЗапросаПоРаботам = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Работы", СтруктураПолей);
	ТаблицаПоРаботам = РезультатЗапросаПоРаботам.Выгрузить();
	
	// Получим необходимые данные для проведения и проверки заполенения данных по табличной части "Материалы".
	ПроведениеДокументов.ПодготовитьТаблицуТоварыДокумента(ЭтотОбъект, ТаблицаПоМатериалам, "Материалы", Новый Структура("КлючСтрокиРаботы","КлючСтрокиРаботы"));
	Для Каждого СтрокаМатериалы Из ТаблицаПоМатериалам Цикл
		Если Не ЗначениеЗаполнено(СтрокаМатериалы.Склад) Тогда
			СтрокаМатериалы.Склад = СкладМатериалов;
		КонецЕсли;
	КонецЦикла;
	ТаблицаПоМатериалам.Колонки.Добавить("Сотрудник");
	Для Каждого СтрокаМатериал Из ТаблицаПоМатериалам Цикл
		СтрокаМатериал.Сотрудник = ЭтотОбъект.Исполнитель;
	КонецЦикла;
		
КонецПроцедуры // ПодготовитьТаблицыДокумента()

Функция ЕстьСтрокиСПустымСкладом(ИмяТЧ)
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект[ИмяТЧ] Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Склад) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ВыполнитьДвиженияПоВыработкеСотрудников(НачислятьВыработку)
	
	Если НачислятьВыработку Тогда 
		
		Для Каждого СтрокаТаблицы Из ЭтотОбъект.Работы Цикл
			
			Движение = Движения.ВыработкаСотрудников.Добавить();
			Движение.Период = ЭтотОбъект.Дата;
			Движение.Сотрудник = ЭтотОбъект.Исполнитель;
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
			Движение.ТипВыработки = Перечисления.ТипыВыработки.Услуги;
			
		КонецЦикла;	
		
		// Материалы, которые включаются в стоимость.
		Для Каждого СтрокаТаблицы Из ЭтотОбъект.Материалы Цикл
			Если СтрокаТаблицы.Сумма <> 0 Тогда
				Движение = Движения.ВыработкаСотрудников.Добавить();
				Движение.Период = Дата;
				Движение.Сотрудник = Исполнитель;
				ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
				Движение.Продолжительность	= 0;
				Движение.ТипВыработки       = Перечисления.ТипыВыработки.Материалы;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
	
	Если ЭтотОбъект.ВычитатьИзВыработкиВиновника Тогда
		
		ДвиженияПоВыработке = Движения.ВыработкаСотрудников.Выгрузить();
		Для Каждого СтрокаДвижение Из ДвиженияПоВыработке Цикл
			Движение = Движения.ВыработкаСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаДвижение);
			Движение.Сотрудник = ЭтотОбъект.Рекламация.Исполнитель;
			Движение.Сумма			= 0 - Движение.Сумма;
			Движение.СуммаБезСкидок = 0 - Движение.СуммаБезСкидок;
			Движение.Количество		= 0 - Движение.Количество;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок) 
	// ТОВАРЫ ПО РЕГИСТРУ СписанныеТовары.
	НаборДвижений = Движения.СписанныеТовары;
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	// Недостающие поля.
	Инд = 0;
	Для каждого Строка Из ТаблицаДвижений Цикл
		Инд = Инд+1;
		Строка.НомерСтрокиДокумента = Инд;
	КонецЦикла;
	ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
